<h1 style = "color:blue" >Indexing Selecting and Filtering </h1>

# Import Pandas and Numpys

In [1]:
import numpy as np
import pandas as pd

# Create a pandas Series object called "obj". The Series object must contain values ranging from 0 to 4, and each value should be assigned an index label. The index labels should be set as "a", "b", "c", "d", and "e"

In [2]:
obj = pd.Series(np.arange(5),
               index = ['a', 'b', 'c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

# Retrieve the value associated with the index label "c" from the Series object. Return the value that corresponds to the index label "c" in the Series

In [3]:
obj["c"]

2

# Retrieve a subset of values from the Series object using slicing. It should return the values from index position 0 up to, but not including, index position 3.

In [4]:
obj[:3]

a    0
b    1
c    2
dtype: int64

# Retrieve a subset of values from the Series object "obj" by passing a list of index labels as the indexing parameter

In [7]:
obj[["a" , "c"]]

a    0
c    2
dtype: int64

# Return a new Series object that includes only the values at the specified index positions 0 and 2. In other words, it should select and return the elements in the Series at the positions 0 and 2.

In [8]:
obj[[0,2]]

a    0
c    2
dtype: int64

# Return a new Series object that includes only the values from the original Series where the corresponding value is less than 2.

In [9]:
obj[obj<2]

a    0
b    1
dtype: int64

# Using slicing to retrieve a subset of values from the Series object "obj" based on index labels. It should return a new Series object that includes the values from the original Series starting from the index label "a" up to and including the index label "c".

In [10]:
obj ["a": "c"]

a    0
b    1
c    2
dtype: int64

# Assign the value 5 to the subset of values in the Series object "obj" between the index labels "b" and "c", inclusive.

In [12]:
obj["b":"c"]=5
obj

a    0
b    5
c    5
d    3
e    4
dtype: int64

# Dataframe Indexing

# Create a pandas DataFrame object named "data". The DataFrame should be constructed with a 4x4 array of values obtained from reshaping the numbers 0 to 15. The array should be reshaped into a 4x4 matrix. Additionally, it should specify the row index labels as "London", "Paris", "Berlin", and "Istanbul", and column labels as "one", "two", "three", and "four".

In [13]:
data = pd.DataFrame(
    np.arange(16).reshape(4,4),
    index = ["London", "Paris", "Berlin", "Istanbul"],
    columns = ["one", "two", 'three', 'four']
)
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

# Retrieve the column labeled "two" from the DataFrame object "data". It should return a pandas Series object that contains the values from the "two" column.

In [14]:
data["two"]

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int64

# Using slicing to retrieve a subset of rows from the DataFrame object "data". It should return a new DataFrame object that includes the first three rows from the original DataFrame. In other words, it should select and return the rows from index position 0 up to, but not including, index position 3.

In [17]:
data[:3]

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

# Return a new DataFrame object that includes only the rows where the value in the "four" column is greater than 5.

In [18]:
data[data["four"]>5]

          one  two  three  four
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

# Modify the DataFrame object "data" by replacing all values that are less than 5 with 0. It should check each element in the DataFrame and replace it with 0 if it is less than 5.

In [19]:
data [data < 5]= 0
data

          one  two  three  four
London      0    0      0     0
Paris       0    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

# Selection with loc and iloc

# loc: This feature is label-based indexing, meaning it allows you to access data based on the labels of rows and columns.  You can use the loc indexer to select specific rows or columns using their labels.  It accepts label-based slicing, single labels, or a boolean array. For example:

df.loc[row_label] retrieves a specific row based on its label.<br>
df.loc[row_label, column_label] retrieves a specific element based on row and column labels.<br>
df.loc[start_row_label:end_row_label, start_column_label:end_column_label] retrieves a subset of rows and columns based on label ranges.

# iloc: This feature is integer-based indexing, allowing you to access data using integer indices of rows and columns. It enables you to select specific rows or columns based on their integer positions, starting from 0. For example:

df.iloc[row_index] retrieves a specific row based on its integer index. <br>
df.iloc[row_index, column_index] retrieves a specific element based on row and column indices.<br>
df.iloc[start_row_index:end_row_index, start_column_index:end_column_index] retrieves a subset of rows and columns based on index ranges.

# Retrieve the second row of the DataFrame object "data" using integer-based indexing. It should return a pandas Series object that contains the values from the second row of the DataFrame.

In [22]:
data.iloc[1]

one      0
two      5
three    6
four     7
Name: Paris, dtype: int64

# Retrieve specific elements from the DataFrame object "data" using integer-based indexing. It should return a new DataFrame object that includes the values from the second row (index position 1) and the specified columns.

In [26]:
data.iloc[1,[1,2,3]]

two      5
three    6
four     7
Name: Paris, dtype: int64

# Retrieve specific elements from the DataFrame object "data" using label-based indexing. It should return a new DataFrame object that includes the values from the row with the label "Paris"

In [27]:
data.loc["Paris"]

one      0
two      5
three    6
four     7
Name: Paris, dtype: int64

# Retrieve a subset of values from the DataFrame object "data" using label-based indexing. It should return a new Series object that includes the values from the "four" column, but only for the rows up to and including the row labeled "Paris"

In [28]:
data.loc[:"Paris", "four"]

London    0
Paris     7
Name: four, dtype: int64

# Task

# Create a pandas Series object named "toy_data". The Series is constructed with values ranging from 0 to 4, obtained using np.arange(5), and iassign index labels "a", "b", "c", "d", and "e" to each value.

In [31]:
toy_data = pd.Series(np.arange(5))
toy_data

0    0
1    1
2    2
3    3
4    4
dtype: int64

# Retrieve the value from the Series object "toy_data" at the index position -1.  Negative indices are used to access elements from the end of a sequence. In this case, it should select and return the last value in the Series.

In [30]:
toy_data[-1]

4